
[Archmage X2SoldierClassTemplate]
DisplayName="大法师"
ClassSummary="一个深耕灵能多年，并因此获得了难以置信的力量的士兵。"
LeftAbilityTreeTitle="法力"
RightAbilityTreeTitle="风暴"
AbilityTreeTitles[0]="法力"
AbilityTreeTitles[1]="风暴"
AbilityTreeTitles[2]="力量"
AbilityTreeTitles[3]="思想"

[KVRend X2AbilityTemplate]
LocFriendlyName="撕裂"
LocLongDescription="近战攻击，有机会使目标昏迷或混乱。必定命中。触发动量，并在杀死敌人时获得专注力。"
LocHelpText="近战攻击，有机会使目标昏迷或混乱。必定命中。触发动量，并在杀死敌人时获得专注力。"
LocPromotionPopupText="<Bullet/> 使用撕裂来杀死敌人是获得专注力的主要方法。<br/><Bullet/> 专注等级越高，撕裂的伤害越高.<br/><Bullet/> 在施放撕裂后，获得动能，允许他们进行一次移动行动。"

[KVArchmageShield X2AbilityTemplate]
LocFriendlyName="护盾"
LocLongDescription="大法师每2级获得2点护盾"
LocHelpText="大法师每2级获得2点护盾"
LocPromotionPopupText="<Bullet/> 作为代价，大法师在升级时不会增加生命值，并且在士兵和上尉等级时会损失1点生命值。"

